Merge Phase7-8
